toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
#include <msp430.h>
#include <cstdint>
#include <cstdbool>
#include <cstddef>
#include <atomic>
#include <ratio>
#include "Toastbox/Scheduler.h"
#include "SDCard.h"
#include "ICE.h"
#include "ImgSensor.h"
#include "ImgAutoExposure.h"
#include "Startup.h"
#include "GPIO.h"
#include "Clock.h"
#include "RTC.h"
#include "SPI.h"
#include "Watchdog.h"
#include "SysTick.h"
#include "RegLocker.h"
#include "MSP.h"
#include "GetBits.h"
#include "ImgSD.h"
#include "I2C.h"
#include "OutputPriority.h"
#include "BatterySampler.h"
#include "Button.h"
#include "AssertionCounter.h"
#include "Triggers.h"
#include "Motion.h"
#include "SuppressibleAssertion.h"
#include "Assert.h"
#include "Timer.h"
#include "Debug.h"
#include "WiredMonitor.h"
#include "System.h"
#include "Property.h"
#include "Time.h"
#include "TimeConstants.h"
#include "LEDFlicker.h"
using namespace GPIO;

using _Clock = T_Clock<_Scheduler, _MCLKFreqHz, _Pin::MSP_XIN, _Pin::MSP_XOUT>;
using _SysTick = T_SysTick<_Scheduler, _ACLKFreqHz>;
using _SPI = T_SPI<_MCLKFreqHz, _Pin::ICE_MSP_SPI_CLK, _Pin::ICE_MSP_SPI_DATA_OUT, _Pin::ICE_MSP_SPI_DATA_IN>;
using _ICE = T_ICE<_Scheduler>;

using _I2C = T_I2C<_Scheduler, _Pin::MSP_STM_I2C_SCL, _Pin::MSP_STM_I2C_SDA, MSP::I2CAddr>;
using _Motion = T_Motion<_Scheduler, _Pin::MOTION_EN_, _Pin::MOTION_SIGNAL>;

using _BatterySampler = T_BatterySampler<_Scheduler, _Pin::BAT_CHRG_LVL, _Pin::BAT_CHRG_LVL_EN_>;

using _Button = T_Button<_Scheduler, _Pin::BUTTON_SIGNAL_>;

using _WiredMonitor = T_WiredMonitor<_Pin::VDD_B_3V3_STM>;

static OutputPriority _LEDGreen_(_Pin::LED_GREEN_{});
static OutputPriority _LEDRed_(_Pin::LED_RED_{});

struct _LEDPriority {
    static constexpr uint8_t Power   = 0;
    static constexpr uint8_t Capture = 1;
    static constexpr uint8_t I2C     = 2;
    static constexpr uint8_t Default = 3;
};

// _ImgSensor: image sensor object
using _ImgSensor = Img::Sensor<
    _Scheduler,             // T_Scheduler
    _ICE                    // T_ICE
>;

// _SDCard: SD card object
using _SDCard = SD::Card<
    _Scheduler,         // T_Scheduler
    _ICE,               // T_ICE
    1,                  // T_ClkDelaySlow (odd values invert the clock)
    6                   // T_ClkDelayFast (odd values invert the clock)
>;

// _RTC: real time clock
using _RTC = T_RTC<_Scheduler, _XT1FreqHz>;
using _Watchdog = T_Watchdog<_ACLKFreqHz, (Time::Ticks64)_RTC::InterruptIntervalTicks*2>;

// _State: stores MSPApp persistent state, intended to be read/written by outside world
// Stored in FRAM because it needs to persist indefinitely.
[[gnu::section(".persistent")]]
static MSP::State _State = {
    .header = MSP::StateHeader,
};

static void _EventsEnabledUpdate();
static void _EventsEnabledChanged();

static void _MotionEnabledUpdate();

static void _VDDIMGSDEnabledChanged();

// _BatteryTrapSaved: remembers our battery-trap state across crashes and LPM3.5.
//
// This needs to be a global for the gnu::section attribute to work.
[[gnu::section(".ram_backup_bss._BatteryTrapSaved")]]
static inline bool _BatteryTrapSaved = false;

// _OnSaved: remembers our power state across crashes and LPM3.5.
// This is needed because we don't want the device to return to the
// powered-off state after a crash.
//
// This needs to be a global for the gnu::section attribute to work.
[[gnu::section(".ram_backup_bss._OnSaved")]]
static inline bool _OnSaved = false;

// _EventsEnabled: whether _TaskEvent should be running and handling events
static T_Property<bool,_EventsEnabledChanged,_MotionEnabledUpdate> _EventsEnabled;

using _MotionRequested = T_AssertionCounter<_MotionEnabledUpdate>;
using _MotionRequestedAssertion = T_SuppressibleAssertion<_MotionRequested>;

// VDDIMGSD enable/disable
using _VDDIMGSDEnabled = T_AssertionCounter<_VDDIMGSDEnabledChanged>;

// _Triggers: stores our current event state
using _Triggers = T_Triggers<_State, _MotionRequestedAssertion>;

static bool _HostModeEnabled();
static void _CaptureStart(_Triggers::CaptureImageEvent& ev, const Time::Instant& time);
static void _I2CWiredChanged();

static Time::Ticks32 _RepeatAdvance(MSP::Repeat& x) {
    static constexpr Time::Ticks32 YearPlusDay = Time::Year+Time::Day;
    
    switch (x.type) {
    case MSP::Repeat::Type::Never:
        return 0;
    
    case MSP::Repeat::Type::Daily:
        Assert(x.Daily.interval);
        return Time::Day*x.Daily.interval;
    
    case MSP::Repeat::Type::Weekly: {
        #warning TODO: verify this works properly
        // Determine the next trigger day, calculating the duration of time until then
        Assert(x.Weekly.days & 1); // Weekly.days must always rest on an active day
        x.Weekly.days |= 0x80;
        uint8_t count = 0;
        do {
            x.Weekly.days >>= 1;
            count++;
        } while (!(x.Weekly.days & 1));
        return count*Time::Day;
    }
    
    case MSP::Repeat::Type::Yearly:
        #warning TODO: verify this works properly
        // Return 1 year (either 365 or 366 days) in microseconds
        // We appropriately handle leap years by referencing `leapPhase`
        if (x.Yearly.leapPhase) {
            x.Yearly.leapPhase--;
            return Time::Year;
        } else {
            x.Yearly.leapPhase = 3;
            return YearPlusDay;
        }
    }
    Assert(false);
}

// MARK: - Abort

static void _ResetRecord(MSP::Reset::Type type, uint16_t ctx) {
    using namespace MSP;
    FRAMWriteEn writeEn; // Enable FRAM writing
    
    Reset* hist = nullptr;
    for (Reset& h : _State.resets) {
        if (!h.count || (h.type==type && h.ctx.u16==ctx)) {
            hist = &h;
            break;
        }
    }
    
    // If we don't have a place to record the abort, bail
    if (!hist) return;
    
    // If this is the first occurrence of this kind of reset, fill out its fields.
    if (hist->count == 0) {
        hist->type = type;
        hist->ctx.u16 = ctx;
    }
    
    // Increment the count, but don't allow it to overflow
    if (hist->count < std::numeric_limits<decltype(hist->count)>::max()) {
        hist->count++;
    }
}

[[noreturn]]
static void _BOR() {
    PMMCTL0 = PMMPW | PMMSWBOR;
    // Wait for reset
    for (;;);
}

// Abort(): called by Assert() with the address that aborted
extern "C"
[[noreturn, gnu::used]]
void Abort(uintptr_t addr) {
    // Disable interrupts
    Toastbox::IntState::Set(false);
    // Record the abort
    _ResetRecord(MSP::Reset::Type::Abort, addr);
    // Wait until all prints have been drained, so we don't drop important
    // info by aborting before it's been read.
    while (!Debug::Empty());
    _BOR();
}

extern "C"
[[noreturn]]
void abort() {
    Assert(false);
}

extern "C"
int atexit(void (*)(void)) {
    return 0;
}

