toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
            if (_Button::EventPending()) {
                switch (_Button::EventRead()) {
                case _Button::Event::Press: {
                    // Ignore button presses if we're off or in host mode
                    if (!_On || _HostModeEnabled()) break;
                    
                    for (auto it=_Triggers::ButtonTriggerBegin(); it!=_Triggers::ButtonTriggerEnd(); it++) {
                        _CaptureStart(*it, _RTC::Now());
                    }
                    break;
                }
                
                case _Button::Event::Hold:
                    // If we're not in battery trap, toggle the power state
                    if (!_BatteryTrap) {
                        _On = !_On;
                    
                    // Otherwise if we are in battery trap, deny the power transition and blink the red LEDs
                    } else {
                        _LEDFlash(_LEDRed_);
                    }
                    break;
                }
            }
        }
    }
    
    static bool On() {
        return _On;
    }
    
    static bool Wired() {
        return _Wired;
    }
    
    static MSP::BatteryLevel BatteryLevel() {
        return _BatteryLevel;
    }
    
    static void BatteryLevelUpdate() {
        // When in battery trap, never sample the battery voltage unless we're wired.
        if (_BatteryTrap && !_Wired) return;
        _BatteryLevelUpdate = true;
    }
    
    static void BatteryLevelWait() {
        _Scheduler::Wait([] { return !_BatteryLevelUpdate; });
    }
    
    static bool BatteryTrap() {
        return _BatteryTrap;
    }
    
    static void CaptureNotify() {
        // Short-circuit if we're in battery trap
        // We don't want to monitor the battery while we're in battery trap, to minimize battery use
        if (_BatteryTrap) return;
        
        _CaptureCounter--; // Rollover OK since we reset _CaptureCounter in Run()
        if (!_CaptureCounter) {
            _BatteryLevelUpdate = true;
        }
    }
    
    static bool ISRRTC() {
        // Short-circuit if we're in battery trap
        // We don't want to monitor the battery while we're in battery trap, to minimize battery use
        if (_BatteryTrap) return false;
        
        _RTCCounter--; // Rollover OK since we reset _RTCCounter in Run()
        if (!_RTCCounter) {
            _BatteryLevelUpdate = true;
            return true;
        }
        return false;
    }
    
    static void _OnChanged() {
        _OnSaved = _On;
        _LEDFlash(_On ? _LEDGreen_ : _LEDRed_);
    }
    
    static void _BatteryLevelChanged() {
        // If our battery level drops below the Enter threshold, enter battery trap
        if (_BatteryLevel <= _BatteryTrapLevelEnter) {
            _BatteryTrap = true;
        
        // If our battery level raises above the Exit threshold, exit battery trap
        } else if (_BatteryLevel >= _BatteryTrapLevelExit) {
            _BatteryTrap = false;
        }
    }
    
    static void _BatteryTrapChanged() {
        _BatteryTrapSaved = _BatteryTrap;
        _LEDFlicker::Enabled(_BatteryTrap);
        // Update _On based on battery trap:
        //   When entering battery trap, turn off.
        //   When exiting battery trap, turn on.
        _On = !_BatteryTrap;
    }
    
    static void _WiredChanged() {
        // Turn ourself on if we become wired and we're not in battery trap
        if (_Wired && !_BatteryTrap) _On = true;
    }
    
    static void _SysTickEnabledChanged() {
        _SysTick::Enabled(_SysTickEnabled);
    }
    
    static void _LEDFlash(OutputPriority& led) {
        // Flash red LED to signal that we're turning off
        for (int i=0; i<5; i++) {
            led.set(_LEDPriority::Power, 0);
            _Scheduler::Delay(_Scheduler::Ms<50>);
            led.set(_LEDPriority::Power, 1);
            _Scheduler::Delay(_Scheduler::Ms<50>);
        }
        led.set(_LEDPriority::Power, std::nullopt);
    }
    
    static void Sleep() {
        // Put ourself to sleep until an interrupt occurs
        
        // Enable/disable SysTick depending on whether we have tasks that are waiting for a deadline to pass.
        // We do this to prevent ourself from waking up unnecessarily, saving power.
        _SysTickEnabled = _Scheduler::TickRequired();
        
        // We consider the sleep 'extended' if SysTick isn't needed during the sleep
//        const bool extendedSleep = false;
//        const bool extendedSleep = true;
        const bool extendedSleep = !_SysTickEnabled;
        _Clock::Sleep(extendedSleep);
        
        // Unconditionally enable SysTick while we're awake
        _SysTickEnabled = true;
    }
    
    static constexpr uint16_t _SampleIntervalRTCDays = 4;
    static constexpr uint16_t _SampleIntervalRTC     = (_SampleIntervalRTCDays * Time::Day) / _RTC::InterruptIntervalTicks;
    static constexpr uint16_t _SampleIntervalCapture = 512;
    
    static constexpr uint8_t _BatteryTrapPercentEnter = 2;
    static constexpr uint8_t _BatteryTrapPercentExit  = 10;
    
    static constexpr MSP::BatteryLevel _BatteryTrapLevelEnter
        = MSP::BatteryLevelMin + ((((uint32_t)MSP::BatteryLevelMax-MSP::BatteryLevelMin)*_BatteryTrapPercentEnter)/100);
    static constexpr MSP::BatteryLevel _BatteryTrapLevelExit
        = MSP::BatteryLevelMin + ((((uint32_t)MSP::BatteryLevelMax-MSP::BatteryLevelMin)*_BatteryTrapPercentExit)/100);
    
    static_assert(_SampleIntervalRTC     == 168);  // Debug
    static_assert(_BatteryTrapLevelEnter == 1311); // Debug
    static_assert(_BatteryTrapLevelExit  == 6554); // Debug
    
    static inline uint16_t _RTCCounter = 0;
    static inline uint16_t _CaptureCounter = 0;
    
    // _On: user-controlled power state
    static inline T_Property<bool,_OnChanged,_EventsEnabledUpdate> _On;
    
    // _BatteryLevel: the cached battery charge level
    static inline T_Property<MSP::BatteryLevel,_BatteryLevelChanged> _BatteryLevel = MSP::BatteryLevelInvalid;
    
    // _BatteryTrap: mode that disables all functionality except time-tracking
    static inline T_Property<bool,_BatteryTrapChanged,_EventsEnabledUpdate> _BatteryTrap;
    
    // _Wired: whether we're currently plugged in
    static inline T_Property<bool,_WiredChanged,_I2CWiredChanged> _Wired;
    
    // _SysTickEnabled: whether SysTick should be enabled while we sleep
    static inline T_Property<bool,_SysTickEnabledChanged> _SysTickEnabled;
    
    static inline bool _BatteryLevelUpdate = false;
    
    static constexpr uint32_t _FlickerPeriodMs      = 5000;
    static constexpr uint32_t _FlickerOnDurationMs  = 20;
    using _LEDFlicker = T_LEDFlicker<_Pin::LED_GREEN_, _ACLKFreqHz, _FlickerPeriodMs, _FlickerOnDurationMs>;
    
