toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
        ev.countRem--;
        if (ev.countRem) {
            EventInsert(ev, ev.time, ev.capture->delayTicks);
        }
    }
    
    static void EventInsert(_Triggers::Event& ev, const Time::Instant& time) {
        _Triggers::EventInsert(ev, time);
        // If this event is now the front of the list, reschedule _EventTimer
        if (_Triggers::EventFront() == &ev) {
            _EventTimerSchedule();
        }
    }

    static void EventInsert(_Triggers::Event& ev, MSP::Repeat& repeat) {
        const Time::Ticks32 delta = _RepeatAdvance(repeat);
        // delta=0 means Repeat=never, in which case we don't reschedule the event
        if (delta) {
            EventInsert(ev, ev.time+delta);
        }
    }

    static void EventInsert(_Triggers::Event& ev, const Time::Instant& time, Time::Ticks32 deltaTicks) {
        EventInsert(ev, time + deltaTicks);
    }

    static void CaptureStart(_Triggers::CaptureImageEvent& ev, const Time::Instant& time) {
        // Reset capture count
        ev.countRem = ev.capture->count;
        if (ev.countRem) {
            EventInsert(ev, time);
        }
    }
    
    static void _EventTimerSchedule() {
        // Short-circuit if we're fast-forwarding through events
        if (!_State.live) return;
        _Triggers::Event* ev = _Triggers::EventFront();
        std::optional<Time::Instant> time;
        if (ev) time = ev->time;
        _EventTimer::Schedule(time);
    }
    
    // _EventPop(): pops an event from the front of the list if it's ready to be handled
    // Interrupts must be disabled
    static _Triggers::Event& _EventPop() {
        _Triggers::Event* ev = _Triggers::EventFront();
        Assert(ev); // We must have an event at this point, or else we have a logic error
        _Triggers::EventPop();
        // Schedule _EventTimer for the next event
        _EventTimerSchedule();
        return *ev;
    }
    
    static void _EventHandle(_Triggers::Event& ev) {
        // Handle the event
        using T = _Triggers::Event::Type;
        switch (ev.type) {
        case T::TimeTrigger:      _TimeTrigger(      (_Triggers::TimeTriggerEvent&)ev      ); break;
        case T::MotionEnable:     _MotionEnable(     (_Triggers::MotionEnableEvent&)ev     ); break;
        case T::MotionDisable:    _MotionDisable(    (_Triggers::MotionDisableEvent&)ev    ); break;
        case T::MotionUnsuppress: _MotionUnsuppress( (_Triggers::MotionUnsuppressEvent&)ev ); break;
        case T::CaptureImage:     _CaptureImage(     (_Triggers::CaptureImageEvent&)ev     ); break;
        }
    }
    
    static void Run() {
        // Reset our state
        Reset();
        
        // Init SPI peripheral
        _SPI::Init();
        
        // Init Triggers
        const Time::Instant startTime = _RTC::Now();
        _Triggers::Init(startTime);
        
        // Fast-forward through events
        if (Time::Absolute(startTime)) {
            for (;;) {
                _Triggers::Event* ev = _Triggers::EventFront();
                if (!ev || (ev->time > startTime)) break;
                _EventHandle(_EventPop());
            }
        }
        
        _State.live = true;
        
        // Schedule _EventTimer for the first event
        _EventTimerSchedule();
        
        for (;;) {
            // Wait for _EventTimer to fire
            _EventTimer::Wait();
            _EventHandle(_EventPop());
        }
    }
    
    static void _VDDBEnabledChanged() {
        _Pin::VDD_B_EN::Write(_State.vddb);
        // Rails take ~1.5ms to turn on/off, so wait 2ms to be sure
        _Scheduler::Sleep(_Scheduler::Ms<2>);
    }
    
    // _EventTimer: timer that triggers us to wake when the next event is ready to be handled
    using _EventTimer = T_Timer<_Scheduler, _RTC, _ACLKFreqHz>;
    
    static inline struct __State {
        __State() {} // Compiler bug workaround
        // live=false while initializing, where we execute events in 'fast-forward' mode,
        // solely to arrive at the correct state for the current time.
        // live=true once we're done initializing and executing events normally.
        bool live = false;
        // power / vddb / vddImgSd: our power assertions
        // These need to be ivars because _TaskEvent can be reset at any time via
        // our Reset() function, so if the power assertion lived on the stack and
        // _TaskEvent is reset, its destructor would never be called and our state
        // would be corrupted.
        T_Property<bool,_VDDBEnabledChanged> vddb;
        _VDDIMGSDEnabled::Assertion vddImgSd;
    } _State;
    
    // Task stack
    SchedulerStack(".stack._TaskEvent")
    static inline uint8_t Stack[256];
};

// MARK: - _TaskMotion

struct _TaskMotion {
    static void Run() {
        // Disable interrupts because _Motion requires it
        Toastbox::IntState ints(false);
        
        for (;;) {
            // Wait for motion to be enabled
            _Scheduler::Wait([] { return _Enabled; });
            
            // Power on motion sensor and wait for it to start up
            _Motion::Power(true);
            
            for (;;) {
                // Wait for motion, or for motion to be disabled
                _Motion::SignalReset();
                _Scheduler::Wait([] { return !_Enabled || _Motion::Signal(); });
                if (!_Enabled) break;
                
                _HandleMotion();
            }
            
            // Turn off motion sensor
            _Motion::Power(false);
        }
    }
    
    static void Enable(bool x) {
        _Enabled = x;
    }
    
    static void _HandleMotion() {
        // When motion occurs, start captures for each enabled motion trigger
        for (auto it=_Triggers::MotionTriggerBegin(); it!=_Triggers::MotionTriggerEnd(); it++) {
            _Triggers::MotionTrigger& trigger = *it;
            // If this trigger is enabled...
            if (trigger.enabled.get()) {
                const Time::Instant time = _RTC::Now();
                // Start capture
                _TaskEvent::CaptureStart(trigger, time);
                // Suppress motion for the specified duration, if suppression is enabled
                const uint32_t suppressTicks = trigger.base().suppressTicks;
                if (suppressTicks) {
                    trigger.enabled.suppress(true);
                    _TaskEvent::EventInsert((_Triggers::MotionUnsuppressEvent&)trigger, time, suppressTicks);
                }
            }
        }
    }
    
    static inline bool _Enabled = false;
    
